app/Http/Middleware/HandleInertiaRequests.php

    public function share(Request $request): array
    {
        $appSetting = Schema::hasTable('app_settings')
            ? AppSetting::query()->first()
---
select * from `app_settings` limit 1