app/Providers/AppServiceProvider.php

select * from `app_settings` limit 1
---
    public function boot(): void
    {
        $appSettings = [
            'name_app' => config('app.name', 'Laravel'),
            'slug' => null,
            'image_url' => null,
        ];

        if (Schema::hasTable('app_settings')) {
            $setting = AppSetting::query()->first();