app/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `users`
select count(*) as aggregate from `roles`
select count(*) as aggregate from `permissions`
select count(*) as aggregate from `app_settings`
---
    public function __invoke(Request $request)
    {
        $summary = [
            'users' => User::count(),
            'roles' => Role::count(),
            'permissions' => Permission::count(),
            'settings' => AppSetting::count(),
        ];