app/Http/Controllers/Admin/PermissionController.php

select * from `permissions` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `permissions`
---
    public function index()
    {
        $search = (string) request('q', '');

        $permissions = Permission::query()
            ->when($search !== '', function ($query) use ($search) {
                $query->where('name', 'like', '%' . $search . '%');
            })
            ->latest()
            ->paginate(10)
            ->through(function (Permission $permission) {
                return [
                    'id' => $permission->id,
                    'name' => $permission->name,
                    'guard_name' => $permission->guard_name,
                    'group' => Str::before($permission->name, '.'),
                ];
            });