app/Http/Controllers/Admin/RoleController.php

    public function index()
    {
        $search = (string) request('q', '');

        $roles = Role::query()
            ->withCount('permissions')
            ->when($search !== '', function ($query) use ($search) {
                $query->where('name', 'like', '%' . $search . '%');
            })
            ->latest()
            ->paginate(10)
            ->through(function (Role $role) {
                return [
                    'id' => $role->id,
                    'name' => $role->name,
                    'guard_name' => $role->guard_name,
                    'permissions_count' => $role->permissions_count,
                ];
            });
---
select `roles`.*, (select count(*) from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `roles`.`id` = `role_has_permissions`.`role_id`) as `permissions_count` from `roles` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `roles`

    public function edit(Role $role)
    {
        return inertia('Admin/Roles/Edit', [
            'role' => [
                'id' => $role->id,
                'name' => $role->name,
                'permissions' => $role->permissions()->pluck('name')->values(),
            ],
            'permissions' => Permission::query()->orderBy('name')->get(['id', 'name']),
---
select `name` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` = 1
select `id`, `name` from `permissions` order by `name` asc