app/Http/Controllers/Admin/SettingController.php

update `app_settings` set `image` = 'uploads/settings/1772814602-online-certification.png', `app_settings`.`updated_at` = '2026-03-06 23:30:02' where `id` = 1
---
            $data['image'] = 'uploads/settings/' . $filename;
        }

        $setting->update($data);