app/Http/Controllers/Admin/UserController.php

select count(*) as aggregate from `users`
select * from `users` order by `created_at` desc limit 10 offset 0
---
    public function index()
    {
        $search = (string) request('q', '');

        $users = User::with('roles')
            ->when($search !== '', function ($users) use ($search) {
                $users->where(function ($query) use ($search) {
                    $query->where('name', 'like', '%' . $search . '%')
                        ->orWhere('email', 'like', '%' . $search . '%')
                        ->orWhereHas('roles', function ($roleQuery) use ($search) {
                            $roleQuery->where('name', 'like', '%' . $search . '%');
                        });
                });
            })
            ->latest()
            ->paginate(10)
            ->through(function (User $user) {
                return [
                    'id' => $user->id,
                    'name' => $user->name,
                    'email' => $user->email,
                    'roles' => $user->roles->pluck('name')->values(),
                ];
            });